{
    "texts": [
        "Looking to sublet May-Aug 5/5 bed, 2 bath, furnished cozy top floor of a house 10 min walk to Waterloo campus, 2min walk to Laurier campus. Dm if interested.",
        "5 Beds 5 Baths - Apartment328 Regina St N, Waterloo, ON N2J 0B5, CanadaBridgeport house, student housing with gym 5 bedroom 5 bathroom apartment1st April 2023 - 26th August",
        "Private Room For Rent321 Lester St, Waterloo, ON N2L 3W6, Canada",
        "Subletting Fergus from May to AugCan also offer lease takeoverLet me know!",
        "Hie there,White Ikea Twin Bed hybrid mattress is available for salePrice $520(Including slats)Needs gone asap as i am moving to a different place and do not need twin size anymore.",
        "1 bedroom available for 4 month sublet for Spring term: May - August 25th 2023 at 303 Westcourt place-4 bed 2 bath (coed)-rent is 675/month-wifi is extra $17 a month-every thing else included (hydro, air conditioning, heating, etc..)-kitchen includes a dishwasher, oven, toaster, and microwave-place is furnished-laundry unit on every floor-12 minute walk to University of Waterloo, also has a lot of buses that run in the areamessage me for more details",
        "5 Beds 5 Baths - Apartment1 Columbia St W, Waterloo, ON N2L 0C8, Canada",
        "1 Bed 1 Bath - Apartment333 King St N, Waterloo, ON N2J 2Z1, Canada",
        "Subletting 5 bed + 5 bath at 265 Lester Street for May-August 2023- Newly renovated & Rent Negotiable!- 5 rooms and 5 bathrooms, 4 washrooms are ensuite and 1 is a private washroom!- Internet, water, heat, hydro all included- Fully furnished bedrooms with double bed, chair, large desk and closet - Fully furnished living room with kitchen island, chairs, coffee table and couch- Fully equipped kitchen with dishwasher and 2 fridges- Large windows in all rooms- Laundry on site - Parking on site (limited)- <10 minute walk to UW and WLU- <5 minute walk to numerous bus routes (29, 19, 202, 12 etc.) PM if you’re interested and for more info, larger groups preferred!",
        "May-August Sublet or Lease Takeover5 Bed 2 Bath PREFERENCE WILL BE GIVEN TO GROUPS OF 5!!Students only!! 3 bed 1 bath upstairs, 2 bed 1 bath downstairs $590 - $625/month depending on the room- 5 min walk to bus — 3 mins ride to UW- furnished common areas, partially furnished bedrooms (negotiable)- in house laundry- utilities included - WIFI not included - Free Parking! Up to 5 spaces in driveway",
        "5 Beds 5 Baths - Apartment168 King St N, Waterloo, ON N2J 0B8, Canada",
        "$750 - Single occupancy private room with shared Bathroom$850 - Single occupancy private room with private Ensuite BathroomAVAILABLE  MAY 1st4 out of 5 spacious bedrooms availableRent includes: Fully furnished rooms (Desk, chair , bed frame, mattress , dresser drawer and closet)All utilities (water,hydro & gas), WI-FI (Rogers)Laundry (Washer & Dryer) Shared Kitchen (sink, stove, microwave, full size fridge)Shared Washroom (with two roommates)Backyard and Bicycle Storage AreaThe house is - 5 min drive to Waterloo Uni and Connestoga- 3 min walk to the bus stop from the house; 10 min bus ride to university -right off the main intersection message me with any questions or for a rental application to apply if interested",
        "Subletting 1 bedroom in a 5 bedroom, 2 bathroom at 251 Lester from May-August-Preferably students-$575/month-fully furnishedDM if interested",
        "- Available from May- $700 includes all costs (utilities, hydro…)- Walking distance to GRT station- 15 mins commute to UW campus- Quiet neighbourhood",
        "5 Beds 5 Baths - Apartment185 King St N, Waterloo, ON N2J 0E1, Canada5 bedroom 5 private bathroom apartment. Looking to sublet one unit from May 1 - August 31st. Right across the street from the science building. $700/month",
        "1 Columbia Street WestLooking for a SPRING2023/SUMMER 2023 sublet for my place at 1 Columbia St West.1/5 Bedrooms with a private ensuite washroomRenting price is $880 all inclusive. Hydro + Wifi included Available May 3rd, 2023 to August 30th, 2023 (There is also more than one room available if needed) Apartment Amenities - Kitchen with full-size appliances (Dishwasher, fridge, freezer, oven/stove) - Air conditioning - Large Living area (Dinning table + Couches + coffee table etc) - Bedroom fully furnished (includes - Desk, Wardrobe, Dresser, Bed + storage) - High-speed WIFI Building Amenities - Study rooms - Game rooms- Gym - Rooftop deck - Movie Theatre - Onsite Laundry facility Utilities - Heat + Water included - If parking is needed (outdoor $100, covered parking $115, garage parking $125)Let me know if interested and for photos of my room/tour.",
        "3 Beds 1 Bath - House83 Seagram Dr, Waterloo, ON N2L 3B6, Canada",
        "Private Room For Rent1 Columbia St W, Waterloo, ON N2L 0C8, Canada",
        "6 unit, 3 floor apartment building (no elevator) parking below building. Looking for sublet from May until end of August. 15 minute walking distance to UW campus. Furnished.",
        "3 Beds 3 Baths - ApartmentLooking for 3 female summer sublets for a 3 bedroom/ 3 bath fully furnished unit. $845/month all utilities included. 5 min walk to WLU and 1 minute walk from bus stop.  Available May 1-Aug 27, 2023Pm for more details!",
        "SPRING SUBLET 321 Lester Street4/5 bedrooms available, 2 bathroomOpen to individual and group leasing!Spacious fully furnished rooms and kitchenClose to Waterloo and Laurier campus$635/monthly, does not include hydro$600/MONTH DISCOUNT IF ALL RENT IS PAID UPFRONTIf you have any questions or would like a tour, feel free to message me ",
        "Private Room For RentWaterloo",
        "1 room available!96 University Ave W, Waterloo, ON N2L 3C9, Canada.",
        "SUBLETTING 1 SPACIOUS BEDROOM WITH ENSUITE BATHROOM255 Sunview St, 12th floorMay - Aug 2023-Space to fit everything you would want + ensuite bathroom-Fully furnished including microwave, desk, chair, double-bed bed frame, and mattress-Includes ALL utilities-Walking distance to Waterloo/Laurier-Washing machine/dryer in the apartment***For only 1 person***",
        "ICON sublet : Male-only, (May - Aug 2023) : available for 4 month. 1 bedroom (den) with 1 shared bathroom available for rent in a 3-bedroom, 2-bathroom unitRoommates are clean and friendlyRoom is fully furnished, and includes a 42-inch mounted TVEn-suite laundry available, along with access to gym, basketball court, study lounges and other amenities. Please message if interested for further details and price range",
        "Lease for Spring 2023 (May 2023 - August 2023)Fully furnished 2 Occupant Suite, a short walk to Wilfred Laurier University, University of Waterloo and Conestoga College. The unit has 2 bedrooms and 2 bathrooms, and 3 appliances (Fridge, Stove, Dishwasher). The unit is also fully furnished with a bed, desk and wardrobe/closet in each room. The unit also has a couch and dining table with 4 chairs in the common area. Wifi is included in the rent, however, hydro is paid separately. Central A/C & Heating included. This apartment also features Secured FOB Access, On-Site Coin Laundry, and parking passes available for purchase from management.**$900/room or $1800 for the entire suite**Message for more information!",
        "Jordan 3Size 12 MensHave Receipt for Proof of Purchase",
        "Subletting this quiet apartment from May-august 2023. Its close to laurier and everything else. 4 other chill guys live here and are in and out with their school. There will be no problems if you are a early riser or night owl and its not a noisy apartment. You got a bedroom with a desk and personal bathroom. Im pricing this lower than my rent you wont find a similar apartment for this price. Come check it out",
        "One of five bedrooms on main floor of student house. Two bathrooms on same floor, laundry in basement.Five minute walk to University of Waterloo.Subletting from April to August.Bedroom comes with bed, desk, and wardrobe. Bed is different than in picture.Parking available, $50 extra",
        "One bedroom available for sublease May 1 - August 31, 2023. Located minutes from Laurier University and close to all amenities. Looking for a male student to share fully furnished apartment with 3 other males students.  Rent is $670/month and includes all utilities and wifi. Parking may be available at an extra cost.",
        "- Available May-August 2023ONLY GIRLS- Located at a quiet crescent, within Walking distance of Wilfrid Laurier University.-BUS ROUTE: 7, 9, 31, 201-All utilities are included-Fully furnished units: bed, desk, chair, common area with sofa and dining set-Appliances provided: fridge, dishwasher, stove, microwave,- Large living room.- Laundry on the first floor, FREE LAUNDRY",
        "sublet may - aug1 Columbia St W, Waterloo, ON N2L 0C8, Canadalooking for a sublet from May - Augustpotential lease takeovergirls only! (5 bedroom apartment)furnished(wardrobe, double/full bed, desk & chair)private bathroom(under sink storage)shared kitchen & living area(dishwasher, microwave, couches, kitchen table & chairs)on-site laundrybuilding is pet friendlygame room, gym, and rooftop in building 10min walk to WLUbus stops surrounding the building(7, 201, 31)rent $735 + hydro ($10-$20)",
        "5 BED • 2 BATH HOUSE FOR RENT• SPRING 2023 (MAY-AUG) OR • FALL 2023 (SEPT-APR 2024) 5 bedrooms available for rent in a two-story house about 5 minutes drive from Conestoga College, Laurier University & Waterloo University. Takes about 15 minutes by bus and the stop is near the house. The ideal rental term is from MAY-AUG 2023 or MAY 2023-APR 2024. Convenient location, located close to the bank, groceries and more!DETAILS:➤ $800 / room (all-inclusive)• High Speed Internet/Wi-Fi included• Hydro and Utilities included• Spacious bedrooms• 2 Private Bathrooms• 2 Separate Kitchens• Parking for 4 cars• Shared Backyard",
        "Private room (1 Person) in a Brand New Town House with shared wash & Kitchen, parking, High speed Internet & Utility included.  Indians Preferred.  This room has a bed & Closet.  Rent not negotiated. Pls leave your contact# if interested, so that I can call you.",
        "Summer term sublet – May 1– Aug 31 (flexible)3/4 bedrooms available in quiet, residential area. Looking for respectful, upper year or graduate students to share house with another female graduate student. $825 monthly (negotiable).WALK to UW CAMPUS (15 minutes), or one minute walk to bus stop (house is located right across the street from CLV).Freshly renovated with quartz countertops, lots of cupboard space, and separate study space with white board.Fully furnished with laundry.Parking available.Each room has big desk, comfy office chair and double or queen bed.Equipped with 2 fridges and 1.5 full bathrooms between 3 people (primary bedroom is occupied by current student and has separate bathroom).Pet and smoke free home.Please let me know if you're interested or have any questions!",
        "One fully furnished bedroom is available for a summer sublet (May 1st-August 31) in a 3 bedroom, 3 bathroom apartment with the possibility to sign a year lease for the following year. Message for details and videos of the apartment. I will set up a time for a showing if you are interested.",
        "-Delivery charges is $ 10. -Starting prices for mattresses is $159.-All sizes mattress available.-King / Queen / Double / Single. - Text for more information and details.-Book Now.",
        "Subletting 4/4 rooms at Fergus House (254 Phillip St) May to August 2023!- $900 - open to negotiation ! - original $1080- 21st floor- Ensuite washrooms- Only 5 Min walk to Waterloo, 15 min walk to Laurier, right beside UW plaza (food, stores, etc)- Wifi, hydro, and utilities included- Fully furnishedBuilding features:- Onsite laundry- Furnished common room lounge with large, flat-screen TV and fireplace- Study & conference rooms- Pool table- Ping pong table- Fully-enclosed theatre room- Dedicated games room with consoles- Onsite management team and 24 hour building securityDM for more info!",
        "We are looking for one other girl to takeover a lease for the 23-24 school year! We are all currently in second year science courses at Laurier. School work is priority but we are a social group who loves a fun night out!",
        "Spring term, May 1st to August 28th, sublet. 3 large bedrooms with one en-suite ($950) and 2 bedrooms with shared bathroom ($850). Internet and all utilities included. Laundry in the unit. All furnished with ergonomic chairs, large turf carpet and LED animation lights on the wall. Please call/text 416.708.6104.",
        "sublet one room with ensuite bathroom on 295 Lester street for spring term (May --Aug.) for $900/month",
        "Private room with a private washroom on 16th floor is available for 2 months sublet from ‘1st April 2023’ to ‘31st May 2023’. Fully furnished room with private mini fridge and tv. Clean and quiet space with building amenities such as fitness room, study room, laundry room etc.",
        "Looking for a female sublet for the spring 2023 term (May to August 2023)Price: $825/month Renting out 1 room in 5 bed 2 bath apartment … See more",
        "I'm looking for a STUDENT SUMMER SUBLET (2023) for my room! $550/month (reduced rate) It is a 5 bedroom ALL FEMALE apartment. Looking for someone who is clean and responsible to move in at the end of April after exams and then move out at the end of August. Must be a STUDENT at WLU or UW• Located on Ezra Ave, it is super central and close to many popular areas.• Lots of food options close by and grocery stores/Walmart/clothing etc. … See more",
        "Available on September 1, 2023. Min 12 months lease.4 bed 4 bath 5 bed 5 bath unit for rental En-suite bathroom, furnished. All rooms come with extra microwave and mini fridge. Laundry in Unit. High speed WiFi … See more",
        "TCL 32\" Class 3- Series 720p LED HD AndroidSmart TV best for Bedroom.Its a smart Tv including netflix prime, chrome cast as well as built in google assistant.TV is in new condition , wrapped remote ,even have the box.The reason for selling this TV is my brother surprised me with a better TV.",
        "*******SUBLET***********Female unit only* Subletting 1 bedroom in a 2 bed 1 bath. It is available from May 1st to August 25th-$900 a month +  hydro  -Brand new appliances, granite countertops, gorgeous views with lots of natural light… See more",
        "- 1/5 Bedroom for sublet (May - August 2023)- Mixed Gender- 261 Lester Street, Waterloo - 5 min walk to UW- Laundry in building… See more",
        "271 Lester StreetThird FloorSubletting 1/5 bedrooms available for 4 months (Summer 2023 Term, May-August)$750/month… See more",
        "Bed frame and mattress available for sale in excellent condition. I am selling it as I moving out to furnished place. Dont need the bed any more. Please dm if interested. Serious enquiries only!",
        "California shutters, vinyl material Zebra blinds, good fabricSale price 5 years warranty Free estimate and installation",
        "Private Room For Rent81 Columbia St W, Waterloo, ON N2L 3K7, CanadaLooking for 2 students to fill a 5bed/2bath apartment starting September 2023. We are 3 UW students going into our second year in the fall. We’re looking for female students, preferably going into their second year at either UW or Laurier. DM for more info!",
        "Looking for 1 female student to sublet in a 3 bedroom female house from May 2023 to Aug 2023 (8 month sublet).330 Westcourt Pl.3 Bed 2 Bath - House… See more",
        "1-4 BEDROOMS AVAILABLE FOR SUMMER TERM SUBLET OR RE-ASSIGNMENT (MAY-AUGUST 2023)4/5 bedrooms in 5 bed 5 bath apartment available for subletting in the summer term (May 2-August 28 2023). Taking individuals or group up to 4 girls. Large bedrooms, fully furnished with double beds, closet, and desk. Each room has its own full ensuite washroom and floor to ceiling windows. … See more",
        "2 Beds 1 Bath - Apartment145 Columbia St W, Waterloo, ON N2L,May - August (spring term) lease takeover2/2 Bedroom Available Fully Furnished … See more",
        "2 Beds 1 Bath - Apartment321 Spruce St, Waterloo, ON N2L 0G4, Canada",
        "Subletting room for Summer term (May-August 2023)$605/month, utilities extra but negotiable!Furnished!… See more",
        "Private Room For Rent86 University Ave W, Waterloo, ON N2L 3C8, Canada",
        "2 bedrooms available, separate units for May 2023 - August 2023one male unit and one female unit!- fully furnished!- utilities included- free on site laundry… See more",
        "*** Available May 2023 - Aug 2023 ***Looking to sublet 1 bedroom in a 2 bed/2 bath apartment. The other roommate will be occupied by a female tenant, so females preferred. Price negotiable and will include utilities, hydro, and internet. … See more",
        "-Delivery charges is $ 20. -Starting prices for mattresses is $129.-All sizes mattress available.… See more",
        "Hi there! I am looking to sublet 1 room in a 3 bedroom apartment that is located right across the street from campus for the months of May- end of August 2023. There is shared laundry in the building and no additional utility fees on top of monthly rent. Please message me if interested!",
        "2 BEDROOMS AVAILABLE IN 5 BEDROOM APARTMENT SUMMER SUBLET:MAY-AUGUST!!$710/month- wifi and utilities included - one free parking spot available - shared bathroom and common areas - in unit washer/dryer - 2 minute walk to Laurier campus and uptown FULLY FURNISHED pm for more details",
        "Subletting 5 Beds 2 Baths - Apartment203 Lester St, Waterloo, ON N2L 0B5, CanadaMay - August 20235 bedrooms available (5 bed 2 bath)$:  Only $762.53 per month! —> Compared to price of $900+ in this building for the upcoming year! One time lease transfer fee of $300.Utilities:- Free utilities: heat/AC, water, internet- Paid utilities: hydro (usually ~$20/month)- Fully furnished with a mattress and bed frame, a desk, a dresser, closet space with a top shelf- Access to a laundry machine and dryer- Food and drink options in the building: Coco bubble tea, Hey Chefz, Foodie Fruitie & more- Apartment is on the intersection of Lester and University Avenue, seconds away from bus stop and routes for easy travelPlease send me a private message if you're interested or if you would like to know more details!",
        "Looking for a female sublet for spring term (May-Aug) for $775/monthUtilities and Internet are includedI'm renting out one room in a 5 bed 2 bath apartment at 81 ColumbiaThere are laundry machines in the apartment buildingWithin walking distance of both UW and WLUAcross from a bus stopWithin walking distance of uptownDM if interested",
        "Looking for Sublets from May-August 2023. 3/5 bedrooms available. Can be a group or individuals. - Female Unit",
        "Private Room For Rent254 Phillip St, Waterloo, ON N2L 0E1, CanadaLooking to sublet my room in Rez One Fergus House for the spring term (May-August). Located across the street from Campus, and has its own bathroom. Room itself is very spacious. My room is no 4 on the floor plan, so it’s slightly larger. The building offers a gym, games room and laundry room on the first floor. I’m currently in Toronto so I wouldn’t be able to offer an in person viewing, but I have a couple short videos of the suite and room available upon request. Asking 925/month. Message if interested, thanks!",
        "In excellent condition. Downsizing.All wood  it can be come apart into two pieces.Width 36”Depth 15 1/2”Length 84”",
        "Jordan 3 Size 5y and 6.5yBrandnew with Receipt •Dm for more info!",
        "Dear all I am a Uwaterloo graduate looking for room starting as early as March 17th . Please dm me if you have anything available. Thank you"
    ]
}